{"/about/":{"data":{"about-imerss#About IMERSS":"About IMERSS","institute-for-multidisciplinary-ecological-research-in-the-salish-sea#Institute for Multidisciplinary Ecological Research in the Salish Sea":"IMERSS is a multidisciplinary, cross–cultural, and transboundary community of practice dedicated to long-term ecological research in the Salish Sea.\nWe strive to foster open access to science, scholarship, technology and art, encouraging individuals to play active roles attending to changes in the ecosystems that surround us."},"title":"About"},"/docs/":{"data":{"":" This documentation is a work in progress.\nDetecting biodiversity change is a complex challenge, involving many “wicked problems” that communities around the world must navigate to make progress toward the goals of the UN Convention on Biological Diversity.\nHere we present a protocol to address a subset of these problems, with a focus on inferring local extinction, or extirpation.\nThis protocol is fully developed and implemented in the research article published in Plants, People, Planet. Through this documentation, we provide a walk-through of this framework, centering on a tutorial dataset.\nB) Search effort, represented by GPS tracks (small circles) and iNaturalist observation traces (large circles) at Bellhouse Park, the size of the circle scaled to represent uncertainty around observer positions. (C) Search effort at Bellhouse Park gridded at 30×30m grid scale; (D) Historical habitat for Crassula connata (green) and Primula pauciflora (blue), with corresponding historical occurrence records (dots), overlain on potential habitat (black). (E) Search effort constrained by the extent of historical and potential habitat. (Adapted from Figure 3, Simon et al. 2025.)"},"title":"Docs"},"/docs/baseline-analysis/":{"data":{"":"","early-assessment-of-local-extinction-risk#Early assessment of local extinction risk":"Baseline analyses offer a useful preliminary approach to assessing biodiversity change. By comparing historical collections data with contemporary “big biodiversity data”, such as those available via the Global Biodiversity Information Facility or iNaturalist, we can identify species or populations that may potentially be at risk of local extinction. Keeping this approach simple, we can overcome some of the immediate challenges posed by the analysis of complex biodiversity data sets."},"title":"Baseline analysis"},"/docs/baseline-analysis/criteria/":{"data":{"":" ","criteria-to-consider#Criteria to consider":"Provenance Likely, we are mostly concerned with change in plant communities of native provenance.\nNative species unreported for more than 20 years at.large.2020 \u003c- read.csv(\"Analysis_Inputs/Galiano_Tracheophyta_summary_reviewed_at_large_2024-10-07.csv\") native.at.large.2020 \u003c- at.large.2020 %\u003e% filter(origin == 'native') n_native \u003c- nrow(native.at.large.2020) cat(\"Of the species unreported for more than twenty years prior to 2020,\", n_native, \"were native plant species.\") ## Of the species unreported for more than twenty years prior to 2020, 50 were native plant species. Taxonomically difficult or cryptic species Graminoids are often easily overlooked, so sighting rates may be less informative regarding extinction risk. Here, we narrow our focus to the more conspicuous dicots and petaloid monocots:\nnative.non.graminoids.at.large.2020 \u003c- native.at.large.2020 %\u003e% filter(order != 'Poales') n_non_graminoids \u003c- nrow(native.non.graminoids.at.large.2020) cat(\"Of the native species unreported for more than twenty years prior to 2020,\", n_non_graminoids, \"were dicots or petaloid monocots.\") ## Of the native species unreported for more than twenty years prior to 2020, 32 were dicots or petaloid monocots. Historical evidence Biological specimens are the strongest evidence we have for biodiversity change assessments. List records can be unreliable, so we limit our assessment to species represented by independently verifiable voucher specimens:\nvouchered.native.non.graminoids.at.large.2020 \u003c- native.non.graminoids.at.large.2020 %\u003e% filter(basisOfHistoricalRecord == 'voucher') n_vouchered \u003c- nrow(vouchered.native.non.graminoids.at.large.2020) cat(\"Of the native dicots and petaloid monocots unreported for more than twenty years prior to 2020,\", n_vouchered, \"were documented by verifiable voucher specimens.\") ## Of the native dicots and petaloid monocots unreported for more than twenty years prior to 2020, 29 were documented by verifiable voucher specimens. From this resulting list, we might apply additional criteria to select a set of candidates for extinction risk assessment. This tutorial focuses on a subset of taxa we considered in our study: Crassula connata, Meconella oregana, Plagiobothrys tenellus, and Primula pauciflora.\nOther important criteria to consider:\nCoordinate uncertainty Geographic coordinates represent one of the most crucial pieces of information for biodiversity change assessments.\nOften we are confronted with limited locality information, which imposes constraints on representation of historical habitat Sometimes, the information is good enough to map species occurrences to precise locations (e.g., 30x30m2 grid cell) Sometimes, the information is good enough to specify a discrete location or habitat patch Sometimes, coordinates are generalized to the geometric centre (centroid) of a given area, with a wide radius of coordinate uncertainty Sometimes, we don’t have any coordinates at all It is exceedingly difficult if not impossible to assess the status of species or populations that lack specific locality information. At the very least, we will want to ensure our targets have generalized coordinates referring to a discrete locality. Depending on the approach, one might want to be even more strict and filter records below a certain threshold of coordinate uncertainty. Otherwise we cannot be confident in our assessment.","open-ended-assessments-of-potential-change#Open-ended assessments of potential change":"In order to proceed beyond an initial baseline analysis to assess possible changes in a system, we can set criteria to focus our attention (and limited resources) on species that are most likely to be vulnerable.\nDepending on the criteria we set, there may emerge many potential target species or populations of concern. On the first pass, however, it is notable that this decision-making process is blind to any conservation priorities we might have (e.g., species assessed as vulnerable at a provincial or national scale), which can bias such assessments.\n“If the focus of nature conservation efforts remains on rare and threatened species only, ignoring moderately common species, we might miss most of the biodiversity changes occurring in our landscapes (Gaston, 2010). On the other hand, many formerly frequent species should be considered as under threat according to IUCN criteria (Jansen et al., 2019).”"},"title":"Target selection criteria"},"/docs/baseline-analysis/data_synthesis/":{"data":{"":"","baseline-analyses-offer-a-practical-approach#Baseline analyses offer a practical approach":"A practical approach to this difficult situation is to forego any advanced modeling practices ab initio and begin instead with a simple baseline analysis of historical vs contemporary sources of biodiversity data. This approach will generally depend on normalization of species occurrence data across multiple datasets, to support the comparison of historical and contemporary species records.\nNormalization of biodiversity data is a thorny enough problem in its own right and not treated here. For this tutorial we assume that names are aligned and any ambiguity (synonymy, orthographic variants, etc.) is resolved between the data being compared.\nBest practice is to adhere to Darwin Core standards for species occurrence data. Different communities may prefer different taxonomic databases, but any standard is acceptable as long as it enables consistent mapping of taxa across datasets. ","combination-of-heterogeneous-data-in-baseline-analyses#Combination of heterogeneous data in baseline analyses":"Statistical approaches to modeling biodiversity change are often paralyzed by limitations inherent in biodiversity data—especially when historical and contemporary data are combined from multiple sources.\nData are commonly unstructured, or heterogeneous, lacking consistent attributes or metadata Data are often biased toward positive detections (lacking absence information) Data may be collected in ways that violate the assumptions of statistical models Georeferencing is often generalized based on vague locality information Data may be sparse, with few or perhaps only singleton records to vouch for historical populations, especially at local scales "},"title":"Data synthesis"},"/docs/baseline-analysis/differences/":{"data":{"":"","identifying-potential-changes#Identifying potential changes":"Differences between historical and contemporary biodiversity data could potentially indicate change in a system:\nHistorically reported species that have not been seen in the last 20–40 years are generally considered ‘historical populations’ whose persistence is considered questionable (Nature Serve 2025) Conversely, species that suddenly appear in a biodiversity record may signal a recent dispersal, colonization or invasion event Here, we focus specifically on “species at large”, i.e., historically reported species that have gone undetected in recent decades.\nSummarize historical baseline data Historical records How many species were historically reported for Galiano Island, prior to the beginning of the Biodiversity Galiano project?\nlibrary(dplyr) library(lubridate) summary \u003c- read.csv(\"Analysis_Inputs/Galiano_Tracheophyta_summary_reviewed_2024-10-07.csv\") reported \u003c- summary %\u003e% filter(reportingStatus == 'reported') confirmed \u003c- summary %\u003e% filter(reportingStatus == 'confirmed') historical.reports \u003c- bind_rows(reported, confirmed) n_hist \u003c- nrow(historical.reports) cat(\"There were\", n_hist, \"species historically known to Galiano Island, prior to the beginning of the Biodiversity Galiano project.\") ## There were 607 species historically known to Galiano Island, prior to the beginning of the Biodiversity Galiano project. confirmed \u003c- confirmed %\u003e% mutate(year.confirmed = as.numeric(substr(firstObservediNat, 1, 4))) confirmed.prior.2020 \u003c- confirmed %\u003e% filter(year.confirmed \u003c 2020) n_confirmed \u003c- nrow(confirmed.prior.2020) cat(n_confirmed, \"of these historical records had been confirmed by 2020.\") ## 432 of these historical records had been confirmed by 2020. at.large.2020 \u003c- anti_join(historical.reports, confirmed.prior.2020) n_at_large \u003c- nrow(at.large.2020) cat(\"This left\", n_at_large, \"species still at large by 2020.\") ## This left 175 species still at large by 2020. at.large.2020 \u003c- at.large.2020 %\u003e% filter(as.Date(eventDate) \u003c as.Date(\"2000-01-01\")) n_unseen20 \u003c- nrow(at.large.2020) cat(\"Of these,\", n_unseen20, \"species had not been reported for more than twenty years prior to 2020.\") ## Of these, 74 species had not been reported for more than twenty years prior to 2020. Populations or species that have gone undetected for many years may be considered at risk of extirpation. However, there are other important criteria that communities may consider before such an assessment is made."},"title":"Comparing data"},"/docs/baseline-analysis/example/":{"data":{"":"Before the beginning of the BioGaliano project in 2015, a total of 607 vascular plant species were reported for Galiano Island, represented by 1,698 records, including 446 herbarium specimens (Fig. 1). After five years of concerted search effort, amounting to \u003e18,000 observations, we documented 559 species on the project, confirming 432/607 historical species reports (71% of the historically reported diversity) and adding 127 new species to the list. This left 175 species still at large by 2020.\nFigure 1. Baseline analysis of Galiano Island’s vascular plant diversity (A) Galiano Island (dark grey) lies in the Southern Gulf Islands of the Salish Sea, a transboundary bioregion that spans southern coastal British Columbia, Canada, and Washington, USA; Inset Map: historical occurrences of target plants (red dots); (B) Heatmap (1×1km grid scale) of Galiano Island vascular plant records from 1948 to 2014 (n=1,698), before the beginning of the Biodiversity Galiano project; (C) Heatmap of occurrence records from 1948 to 2024 (n=20,435), including all records consolidated on the project to date. Herbarium specimens (n=446) housed at the Royal BC Museum (V) and UBC Beaty Biodiversity Museum (UBC) represent 14% of historical data, with the remainder comprising records from the grey literature, private species checklists, and the BC Conservation Data Centre. Most records (75%) of the total dataset were reported via the iNaturalist platform. The map scale is identical in A (inset), B and C."},"title":"Example"},"/docs/extirpation/":{"data":{"":"After a gridded search effort density dataframe has been assembled, inference of extirpation risk proceeds in two stages.\nIn the first stage, we infer an posterior distribution for extirpation probability for each cell in historical and potential habitat.\nIn the second stage, these per-cell estimates are pooled into regional estimates for extirpation, forming quantified proxies for the IUCN extinction criteria, complete with uncertainty estimates.\nAt both stages, prior and posterior estimates of extirpation are modelled using Bayesian inference on distributions from the beta family."},"title":"Inferring extirpation"},"/docs/extirpation/beta/":{"data":{"":"","a-convenient-choice-for-rapid-bayesian-inference#A convenient choice for rapid Bayesian inference":"The beta distribution is a convenient choice for representing Bayesian inference on a probabilistic quantity such as probability of extirpation or probability of sighting. It is a distribution on the interval \\([0, 1]\\) which allows us to quickly estimate these probabilities and also summarise our confidence of these estimates, represented by how peaked the distribution is around its maximum. make_beta \u003c- function (prob, weight) { c(prob * weight, (1 - prob) * weight) } # Beta distribution statistics from https://en.wikipedia.org/wiki/Beta_distribution beta_mean \u003c- function (bf) { bf$alpha / (bf$alpha + bf$beta) } beta_variance \u003c- function (bf) { bf$alpha * bf$beta / ((bf$alpha + bf$beta)^2 * (bf$alpha + bf$beta + 1)) } Expand for mathematical details We model the probability of a species’ extirpation in a particular area. For consistency with mathematical treatments, we present calculations with a random variable \\(θ\\) encoding the probability of presence in the range \\([0, 1]\\) and convert to \\(1-θ\\), the probability of extirpation when we summarise our results. Observations of presence or absence \\(y_t\\) are governed by a Bernoulli process with parameter \\(θ\\), where \\(p(y_t |θ)=θ\\) if \\(y_t =1\\) represents presence. Following the notation of Royle and Dorazio (2008), we updated our prior beliefs (prior distribution \\(π(θ)\\)) using a probabilistic model (likelihood function \\(f(y|θ)\\)) to derive posterior beliefs (posterior distribution \\(π(θ|y)\\)). This produces the classical form of Bayes theorem for inference written as: $$π(θ|y) ∝ π(θ)f(y|θ)$$ (Equation 1) We modeled the probability of presence by the beta distribution on \\([0, 1]\\), which is described by two shape parameters \\(α\\) and \\(β\\) and takes the form: $$f(y|α,β) ∝ y^{(α-1)} (1-y)^{(β-1)}$$ (Equation 2) This is a convenient choice because, under the Bayesian framework, we can select a conjugate prior within this family, which leads to a posterior distribution in the same family. Given our observations of target species take the form of binary variables (all representing non-detection), these can be placed within a hierarchical Bayesian modeling context where the shape parameters \\(α\\) and \\(β\\) represent hyperparameters for our modeled distributions. "},"title":"The beta distribution"},"/docs/extirpation/region/":{"data":{"":"Having arrived at individual values for the beta parameters for each cell in a region (historical or potential), we then transfer these into beta parameters for a regional distribution using moment matching:\n# Compute beta parameters given moments # Taken from https://stats.stackexchange.com/a/12239 beta_params_from_moments \u003c- function (mu, var) { alpha \u003c- ((1 - mu) / var - 1 / mu) * mu ^ 2 beta \u003c- alpha * (1 / mu - 1) return (params = list(alpha = alpha, beta = beta)) } apply_region_moments \u003c- function (stats, mu, var) { params \u003c- beta_params_from_moments(mu, var) hdi \u003c- hdiBeta(params$alpha, params$beta, p = 0.9) fields \u003c- list(Central = rp(1 - mu), Low = rp(1 - hdi[2]), High = rp(1 - hdi[1]), alpha = rv(params$alpha), beta = rv(params$beta), mu = mu, var = var) modifyList(stats, fields) } "},"title":"Pooling search effort"},"/docs/extirpation/single_cells/":{"data":{"":" The IUCN defines a taxon as ‘presumed extinct’ “when exhaustive surveys in known and/or expected habitat … have failed to record an individual.”","what-constitutes-a-complete-search#What constitutes a complete search?":"Imagine yourself in a $30\\times30\\text{ m}$ area: How much time do you think you need to adequately search this area?\nThere are many factors to consider here, including the size of the target organism, the complexity of its environment, search conditions, the surveyor’s efficacy, etc..\nThis is not a simple geometric problem, or challenge of searching every $m^2$ of an area. Best practices for species inventory and rare species surveys recommend the “intuitive search” as the most effective approach (Canada, Ministry of Environment and Climate Change Strategy, 2018), because species often occupy specific niches that are unevenly distributed across the landscape.\nUnless one has data to calculate detection probabilities, it is not possible to fit a fully probabilistic model to solve this problem. Hence, we must resort to a heuristic: how much effort do we need to exhaust in an area before we are satisfied that our search is complete?\nOur method incorporates a search weight parameter $W_s$ that must be defined to infer extirpation probability for a given cell. We propose this parameter as a necessary heuristic, which provides a means of overcoming the impasse posed by alternative modeling approaches (e.g., MCMC), which are data hungry and cannot be satisfied in this context.\nThis parameter should ideally be assigned a priori with careful consideration for the study system or target organism.\nExpand for mathematical details Under Bayesian inference, our beta distribution parameters on an unsuccessful Bernoulli trial (representing a failure to observe) will update from \\((α,β)\\) to \\((α,β+1)\\). However, given the search is a continuous process, we have a free parameter representing the quantity of search effort that represents a discrete “trial”—our search effort \\(S_t\\) in a particular cell results in a posterior update to \\((α,β+S_t W_s)\\) where \\(W_s\\) represents the weighting applied to search effort. This weighting depends on many factors influencing the efficacy of initial intuitively reasoned search efforts, including the searcher's efficiency, the species' detectability, or the search conditions. Hence, this free parameter should be considered in relation to \\(W_p\\). Our weighting was set by eliciting a defensible level of confidence in extirpation given varying amounts of search effort within a single \\(900m^2\\) cell, leading to a value \\(W_s\\) of \\(15\\). "},"title":"Effective search effort"},"/docs/extirpation_historical/":{"data":{"":""},"title":"Inferring extirpation in historical habitat"},"/docs/extirpation_historical/example-i/":{"data":{"":" Gridded search data are passed for computing regional statistics as the second argument to the analyse_accepted function in Analyse.R:\nanalyse_accepted(thisTarget, accepted_grouped_merged, habitat_to_centres, exp_weight = exp_weight, solow_prob = solow_low) Here exp_weight is the exponential kernel distance weighting parameter and solow_prob is the Solow prior probability of sighting. This produces posterior regional statistics for extirpation in historical habitat as follows:\ntarget_stats \u003c- read.csv(\"Analysis_outputs/Intermediate/Primula pauciflora_stats.csv\") target_stats_historical \u003c- target_stats %\u003e% dplyr::filter(Population == \"PP1\") paged_table(target_stats_historical) These show the computed parameters of the posterior beta distribution for extirpation expressed in two different forms - the standard (alpha, beta) representation and (mu, var) as parameters for the central estimate for sighting probability and its dispersion. Confidence bands are placed for this at [91.2%, 100.0%].\nHere is this posterior distribution graphed out:"},"title":"Example I"},"/docs/extirpation_historical/example-ii/":{"data":{"":" Gridded search data are passed for computing regional statistics as the second argument to the analyse_accepted function in Analyse.R. This data format is explained in the previous example\nThis produces posterior regional statistics for extirpation in historical habitat as follows:\ntarget_stats \u003c- read.csv(\"Analysis_outputs/Intermediate/Crassula connata_stats.csv\") target_stats_historical \u003c- target_stats %\u003e% dplyr::filter(Population == \"CC1\") paged_table(target_stats_historical) These show the computed parameters of the posterior beta distribution for extirpation expressed in two different forms - the standard (alpha, beta) representation and (mu, var) as parameters for the central estimate for sighting probability and its dispersion. Confidence bands are placed for this at [90.7%, 100.0%].\nHere is this posterior distribution graphed out:"},"title":"Example II"},"/docs/extirpation_potential/":{"data":{"":"Inference of extirpation in potential habitat proceeds as with inference for historical habitat, with the additional element to the analysis that our prior probability of extirpation is modified by a distance kernel, which assigns decreasing probability of persistence with increasing distance from historical habitat."},"title":"Inferring extirpation in potential habitat"},"/docs/extirpation_potential/distance_prior/":{"data":{"":"Estimating the likelihood of a plant’s occurrence beyond the extent of its historical habitat presents a Wallacean dilemma, as species often exhibit restricted distributions despite the apparent availability of suitable habitat (Lomolino, Riddle and Brown., 2006). To address this dilemma, we applied the negative exponential distance weighting system widely used in metapopulation ecology to model patch-occupancy dynamics (Hanski, 1994; Hanski et al., 2017; Yeiser et al., 2021; Hanski \u0026 Ovaskainen, 2002). This method was chosen for its analytical simplicity, based on the assumption that patch occupancy probabilities decrease with varying distance from historical source populations, depending on the rarity patterns of target plants.\nWe selected kernel values by linking them with rarity types (Kruckeberg and Rabinowitz, 1985; Crisfield et al., 2024) and then assigning typologies to target species. Kernel assignments were justified by comparing plotted distance decay rates with regional distribution patterns of target plants. Validation was also drawn from comparisons with the observed distance decay rates of detected targets relative to the position of first historical records (Supplementary Materials). This gives rise to a distance-based prior distribution for presence (P_d = exp(-\\gamma d) ) where d represents the distance of the patch from a historical record and (\\gamma) represents the kernel value."},"title":"Inverse distance prior"},"/docs/extirpation_potential/example-i/":{"data":{"":" … This produces posterior regional statistics for extirpation across all habitat as follows:\nThese show the computed parameters of the posterior beta distribution for extirpation expressed in two different forms - the standard (alpha, beta) representation and (mu, var) as parameters for the central estimate for sighting probability and its dispersion. Confidence bands are placed for this at [68.4%, 100.0%].\nHere is this posterior distribution graphed out - whilst the most probable extirpation value is 100% because of the folded nature of the beta distribution, this is a more dispersed distribution than that for historical habitat and the central estimate of extirpation probability is 86.3%."},"title":"Example I"},"/docs/extirpation_potential/example-ii/":{"data":{"":" … This produces posterior regional statistics for extirpation across all habitat as follows:\nThese show the computed parameters of the posterior beta distribution for extirpation expressed in two different forms - the standard (alpha, beta) representation and (mu, var) as parameters for the central estimate for sighting probability and its dispersion. Confidence bands are placed for this at [76.7%, 100.0%].\nHere is this posterior distribution graphed out - whilst the most probable extirpation value is 100% because of the folded nature of the beta distribution, this is a more dispersed distribution than that for historical habitat and the central estimate of extirpation probability is 90.9%."},"title":"Example II"},"/docs/extirpation_potential/kernel_validation/":{"data":{"":"For detected species, negative-exponential kernels were estimated empirically by regressing the distances of species detections from the position of initial records, against the background of unsuccessful detections. This was done with the brms package (Bürkner, 2017) using Markov Chain Monte Carlo sampling in STAN. Our regression applies the Bernoulli distribution family to the target detection via a modelling function (occupancy_i 〜 q .exp( d_i) ) where is the kernel width, q scales the overall detection rate (not of interest to this analysis) and di is the distance from historical habitat of occupancy observation (occupancy_i).\n## Calibrating "},"title":"Kernel validation"},"/docs/extirpation_potential/rarity_types/":{"data":{"":"","xxxx#XXXX":" ## Calibrating "},"title":"Rarity types"},"/docs/inferring_extirpation_risk/":{"data":{"":" ","detection-frequency#Detection frequency":"A useful metric for assessing extirpation risk is the detection frequency or sighting rate of a species. Species that were observed only once historically may have a different likelihood of persistence than those recorded repeatedly before disappearing from records. In other words, the number and frequency of historical observations can inform our prior belief about whether a species is likely still extant or has been extirpated.\nWhen many records attest to a species’ historical presence, we can be more confident that it represented a well-established population. Conversely, if a species was reported only once or twice, historical populations may have been small, transient, or non-viable—or the species may still be present but overlooked due to rarity or limited sampling effort.\nSighting rates thus constitute informative prior knowledge that can be incorporated into models to estimate extinction probabilities."},"title":"Inferring extirpation risk"},"/docs/inferring_extirpation_risk/example/":{"data":{"":" Here we consider the sighting rate of one of our targets, Plagiobothrys tenellus, as an example. We will use this sighting rate to test the null hypothesis that extinction has not occurred.\nFirst, we assume 1958, the date of the first botanical collection on Galiano Island, as the earliest date that observations of this species might have been made, and 2019—the date that our study began—as the time frame bracketing our analysis.\n$T_0$ = 1958 $T$ = 2019 How many times has this species been observed historically on Galiano Island?\nrecords \u003c- read.csv(\"Analysis_Inputs/Galiano_Island_vascular_plant_records_2024-10-09.csv\") # Filter for Plagiobothrys tenellus records Ptenellus \u003c- records %\u003e% filter(scientificName == 'Plagiobothrys tenellus') # Omit list records, retaining only vouchered specimens Ptenellus \u003c- Ptenellus %\u003e% filter(basisOfRecord != 'MaterialCitation') n_Ptenellus \u003c- nrow(Ptenellus) cat(\"Plagiobothrys tenellus has been observed\", n_Ptenellus, \"times historically.\") ## Plagiobothrys tenellus has been observed 3 times historically. $n$ = 3 When was the most recent sighting?\nrecords \u003c- read.csv(\"Analysis_Inputs/Galiano_Island_vascular_plant_records_2024-10-09.csv\") # Identify the most recent sighting recent_sighting \u003c- max(Ptenellus$eventDate) cat(\"Plagiobothrys tenellus was last observed in\", recent_sighting, \".\") ## Plagiobothrys tenellus was last observed in 1998-04-10 . \\(t_n = 1998\\) Below, the interactive calculator ascribes these to values to Solow's extinction equation. The resulting Bayes factor, \\(B(t)\\), favours the null hypothesis that extinction has not occurred. We also report our prior probability of presence, \\(PP(t)\\), and \\(EP(t) = 1 - PP(t)\\), our prior probability of extinction—which feed into subsequent analyses.\nT₀ (Beginning of record-keeping): tₙ (Most recent sighting): T (Current time/study endpoint): n (Number of observations): Bayes factor in favour of presence B(t): -- Prior probability of presence PP(t): -- Prior probability of absence EP(t): -- "},"title":"Example I"},"/docs/inferring_extirpation_risk/solow_calculation/":{"data":{"":"","inferring-local-extinction-based-on-limited-occurrence-data#Inferring local extinction based on limited occurrence data":"To estimate the likelihood of a species presence before considering any new evidence, we use a non-parametric extinction test—a method developed by Solow (1993). This approach starts from the simple idea that the timing of past sightings contains information about whether a species might have disappeared. If a species was last observed long ago, and we’ve continued searching without finding it again, our confidence in its persistence declines.\nSolow’s method expresses this intuition mathematically by comparing three key times, for a species that has been observed $n$ times during an observation period:\n$T_0$ — the beginning of formal record-keeping, or the earliest time we could reasonably have detected the species if it were present $t_n$ — the time of the most recent confirmed sighting $T$ — the current time or the endpoint of our study The formula calculates an odds ratio (called a Bayes factor) that weighs the likelihood that the species is still present versus extinct, based on how long it has gone unobserved. The smaller the time between the last sighting and today $(t_n - T_0)$, relative to the total observation period $(T - T_0)$, the lower the odds that the species persists.\nExpand for mathematical details Solow (1993) provides a framework for determining a reasonable prior distribution for belief about species extinction when observational data are limited. Their Equation 3 presents a Bayes Factor for summarizing evidence in favor of extinction, given by: \\(B(t) = (n - 1) / [((T - T_0)/(t_n - T_0))^{(n - 1)} - 1]\\) where \\(n\\) is the number of observations, \\(t_i\\) represents the \\(ith\\) sighting time, \\(T\\) is the present date and \\(T_0\\) is the start of the period of observation. In the case \\(n = 1\\) this formula simplifies to \\(B(t) = 1 / ln((T - T_0)/(t_n - T_0))\\). "},"title":"Solow calculation (Prior I)"},"/docs/mapping_habitat/":{"data":{"":"","mapping-habitat#Mapping habitat":"\rMapping habitat Habitat can be represented in many ways, ranging from complex species distribution models to relatively simple ecosystem mapping or site classification data.\nIn this tutorial, we use high resolution (1:5,000 scale) site classification mapping to map habitat for our target species. This spatial data takes the shape of polygons circumscribing different ecosystem types or areas of land use. This versatile approach should be accessible to many communities, wherever land classification or terrestrial ecosystem mapping data are available. Otherwise, habitat can be mapped based on orthoimagery generated using a variety of methods (e.g., satellite, drone).\nFiltering site classification mapping based on habitat types for target species First, we select the site classifications representing suitable habitat for our targets: woodlands (WD), cliffs (CL), herbaceous (HB) habitat types. These are extracted as polygons, then converted to grid cells.\nConverting polygons to gridded representation of habitat Polygons representing habitat for target species is then represented as grid cells. For this methodology, a key consideration is to ensure that the grid scale corresponds with the precision of features representing search effort (see next section).\nThe following map shows the polygon representation of the habitat surrounding Bellhouse Park as green polygons, and the resulting gridded habitat to 30x30 m^2 cells as black squares. Choosing Primula pauciflora as our target taxon, we select 9 of these cells as the historical habitat, shown in blue.\nExpanding this grid to the entire island shows the grid for potential habitat:"},"title":"Representing habitat"},"/docs/overview/":{"data":{"":"The global biodiversity crisis stems from a cascading series of extirpations driving species toward extinction. Addressing this crisis requires methods for early detection of extinction at local scales, where communities can mobilise conservation efforts. We present a method for the detection of species extirpation, harnessing biological specimens, community science, and targeted surveys. Our framework aligns with IUCN extinction criteria and provides a practical means of testing the hypothesis of extinction. By streamlining the integration of data into a practical framework for inference, our approach overcomes key challenges in inferring local extinction risk, supporting efforts to detect and mitigate biodiversity loss.\nWe need systems that allow communities to track biodiversity change locally, to curb biodiversity loss at its source.\nGaliano Island local Shauna Anderson documenting a population of Trifolium dichotomum on Mount Galiano on 5 June 2022. The species had last been reported from the island based on a herbarium collection made by Harvey Janszen in 1981, and thus had gone undocumented for more than forty years."},"title":"Overview"},"/docs/overview/extinction_criteria/":{"data":{"":"The International Union for the Conservation of Nature (IUCN, 2012) has established global standards for the assessment of extinction events.\n“The IUCN defines a taxon as ‘presumed extinct’ (in our case, equivalent to extirpated—or locally extinct) “when exhaustive surveys in known and/or expected habitat, at appropriate times (diurnal, seasonal, annual), throughout its historic range have failed to record an individual.”\nHowever, it remains a major challenge to determine the evidentiary thresholds implied by these criteria (‘exhaustive’, ‘expected’, ‘appropriate’), not only to clarify the formal requirements for claims regarding extirpation but also to inform effective search methods and to assess the feasibility of meeting these requirements.\nOur goal is to transform the abstract problem of assessing extinction into a structured, measurable, and actionable process. To that end, this documentation clarifies the steps and assumptions underlying the IUCN extinction criteria and proposes a practical methodology for applying them to infer extinction events in real-world contexts."},"title":"IUCN extinction criteria"},"/docs/references/":{"data":{"":" This is a placeholder page that shows you how to use this template site.\nIf your project has an API, configuration, or other reference - anything that users need to look up that’s at an even lower level than a single task - put (or link to it) here. You can serve and link to generated reference docs created using Doxygen, Javadoc, or other doc generation tools by putting them in your static/ directory. Find out more in Adding static content. For OpenAPI reference, Docsy also provides a Swagger UI layout and shortcode that renders Swagger UI using any OpenAPI YAML or JSON file as source."},"title":"References"},"/docs/search_effort/":{"data":{"":"Search effort is represented as a per-observer search time per gridded cell represented in ksec. Search effort is applied only to valid potential or historical habitat for the target taxon. Where the habitat model indicates that only part of a grid cell is valid habitat, the imputed search effort is scaled up proportionally.\n# From Analyse.R, # Assemble the cells which truly lie within the habitat together with their proportion of overlap analyse_target \u003c- function (thisTarget, detected = FALSE) { .... effortCells_intersect \u003c- st_intersection((accepted_grouped_sf %\u003e% filter(search_effort \u003e 0)), allHabitat) %\u003e% mutate(area = st_area(.) %\u003e% as.numeric(), area_prop = area / oneArea) %\u003e% select(cell_id, area, area_prop) %\u003e% st_drop_geometry() } "},"title":"Search effort"},"/docs/search_effort/example-i/":{"data":{"":" ","historical-habitat#Historical habitat":"This map shows the accumulated search effort for Primula pauciflora over its historical habitat covering 9 grid cells in Bellhouse Park:\nprim_agm \u003c- read.csv(\"Analysis_outputs/Intermediate/Primula pauciflora_accepted_grouped_merged.csv\") prim_historical \u003c- prim_agm %\u003e% dplyr::filter(assigned_community == \"PP1\") prim_sf = assign_cell_geometry_sf(prim_historical, galgrid) pal \u003c- colorNumeric(palette = \"viridis\", domain = range(c(0, prim_sf$search_effort), na.rm = TRUE)) m \u003c- leaflet(data = prim_sf) %\u003e% # Add a Tiles layer to the map addProviderTiles(\"Esri.WorldImagery\") %\u003e% # Add the grid layer to the map addPolygons(fillColor = ~pal(search_effort), fillOpacity = 0.8, color = \"#BDBDC3\", weight = 1) %\u003e% # Add a legend addLegend(pal = pal, values = c(0, max(prim_sf$search_effort, na.rm = TRUE)), opacity = 0.8, title = \"Accumulated Search Effort in ks\") # Print the map m The table that this plot is generated from is in the AGM (accepted, grouped, merged) format, output by the data pipeline which aggregates search trace data, grids it into cells and intersects it with habitat polygons. Here is the data covering the 9 Bellhouse Park cells:\nHere is a description of the columns in this table:\nAGM Column Description cell_id Numeric cell id, allocated to a grid cell as configured in the project’s config.R file and manipulated by the utilities in geomUtil.R effortId A string which summarises each of the search efforts contributing to this search cell. This is purely for traceability and is not used by the analysis computing extirpation probability search_effort Total accumulated search effort for this grid cell measured in ksec by all observers fringe_dist The distance of this cell from historical habitat - these values are all 0 above since the cells lie within the historical habitat assigned_community The historical community to which this cell is assigned. These numbers are taken from row numbers in the historical plant records table after filtering for those with coordinates - for this analysis in target_plant_records_2024.csv area Effective area of the grid cell in square metres after intersecting it with valid habitat polygons - for this analysis, a full cell will be approximately 900 sqm area_prop The proportion that the effective grid cell area is of a standard full grid cell - for this analysis, 900 sqm ","potential-habitat#Potential habitat":"This map shows the accumulated search effort for Primula pauciflora over both historical and potential habitat:\nprim_agm \u003c- read.csv(\"Analysis_outputs/Intermediate/Primula pauciflora_accepted_grouped_merged.csv\") prim_sf = assign_cell_geometry_sf(prim_agm, galgrid) pal \u003c- colorNumeric(palette = \"viridis\", domain = range(c(0, prim_sf$search_effort), na.rm = TRUE)) m \u003c- leaflet(data = prim_sf) %\u003e% addProviderTiles(\"Esri.WorldImagery\") %\u003e% # Add the grid layer to the map addPolygons(fillColor = ~pal(search_effort), fillOpacity = 0.8, color = \"#BDBDC3\", weight = 1) %\u003e% # Add a legend addLegend(pal = pal, values = c(0, max(prim_sf$search_effort, na.rm = TRUE)), opacity = 0.8, title = \"Accumulated Search Effort in ks\") # Print the map m See the treatment of historical habitat for explanation of the data format underlying this plot."},"title":"Example I"},"/docs/search_effort/example-ii/":{"data":{"":" ","historical-habitat#Historical habitat":"This map shows the accumulated search effort for Crassula connata over its historical habitat covering 6 grid cells in Bellhouse Park:\ncracon_agm \u003c- read.csv(\"Analysis_outputs/Intermediate/Crassula connata_accepted_grouped_merged.csv\") cracon_historical \u003c- cracon_agm %\u003e% dplyr::filter(assigned_community == \"CC1\") cracon_sf = assign_cell_geometry_sf(cracon_historical, galgrid) pal \u003c- colorNumeric(palette = \"viridis\", domain = range(c(0, cracon_sf$search_effort), na.rm = TRUE)) m \u003c- leaflet(data = cracon_sf) %\u003e% # Add a Tiles layer to the map addProviderTiles(\"Esri.WorldImagery\") %\u003e% # Add the grid layer to the map addPolygons(fillColor = ~pal(search_effort), fillOpacity = 0.8, color = \"#BDBDC3\", weight = 1) %\u003e% # Add a legend addLegend(pal = pal, values = c(0, max(cracon_sf$search_effort, na.rm = TRUE)), opacity = 0.8, title = \"Accumulated Search Effort in ks\") # Print the map m The table that this plot is generated from is in the AGM (accepted, grouped, merged) format, output by the data pipeline which aggregates search trace data, grids it into cells and intersects it with habitat polygons. Here is the data covering the 6 Bellhouse Park cells:\nThis data format is explained in the previous example","potential-habitat#Potential habitat":"This map shows the accumulated search effort for Crassula connata over both historical and potential habitat:\ncracon_agm \u003c- read.csv(\"Analysis_outputs/Intermediate/Crassula connata_accepted_grouped_merged.csv\") cracon_sf = assign_cell_geometry_sf(cracon_agm, galgrid) pal \u003c- colorNumeric(palette = \"viridis\", domain = range(c(0, cracon_sf$search_effort), na.rm = TRUE)) m \u003c- leaflet(data = cracon_sf) %\u003e% addProviderTiles(\"Esri.WorldImagery\") %\u003e% # Add the grid layer to the map addPolygons(fillColor = ~pal(search_effort), fillOpacity = 0.8, color = \"#BDBDC3\", weight = 1) %\u003e% # Add a legend addLegend(pal = pal, values = c(0, max(cracon_sf$search_effort, na.rm = TRUE)), opacity = 0.8, title = \"Accumulated Search Effort in ks\") # Print the map m See the treatment of historical habitat for explanation of the data format underlying this plot."},"title":"Example II"}}